// const task5 = () => {
//   // нужно оставить в коробках разное колличество шаров - 
//   // 1 коробка - 1 шар
//   // 2 коробка - 2 шара 
//   // ...
//   // 20 коробка - 20 шара 
//   // тогда мы увидим за одно взвешивание в какой коробке перевес,
//   // тк если бы все шары были по 1кг то вес был бы 210кг
// }

const task4 = () => {

}

// const task3 = () => {
//   // N ночей что бы все голубоглазые улетели
// }

// const task2 = () => {
//   P(AB) = 1/4
// }



// const task1 = (arr, l) => {
//   if (l === 1) {
//     return 1;
//   }

//   return l * task1(arr, l-1)
// }

// console.log(`task1([1,2,3], 3)`, task1([1,2,3], 3))
